We are calling pandas as pd and this allows calling the functions in pandas as pd.function_name() instead of pandas.function_name(). This is a standard convention in Python programming and you will see it in many places. It is also common to see import pandas as pd, which is the same thing but allows you to use pd instead of pandas.

In [1]:
import pandas as pd

Pandas Series is a one-dimensional labeled array capable of holding any data type (integers, strings, floating point numbers, Python objects, etc.). The axis labels are collectively called index. Pandas Series is nothing but a column in an excel sheet.

In [31]:
obj=pd.Series(['apple', 2, ['a','b','c'], 3.5, {'key':'value'}])

In [26]:
obj

0               apple
1                   2
2           [a, b, c]
3                 3.5
4    {'key': 'value'}
dtype: object

In [32]:
obj.index

RangeIndex(start=0, stop=5, step=1)

In [27]:
obj.values

array(['apple', 2, list(['a', 'b', 'c']), 3.5, {'key': 'value'}],
      dtype=object)

If you want to create a Series with your own index, you can do so by passing in a list of values along with the index.

In [33]:
obj.index=['a','b','c','d','e']

In [34]:
obj

a               apple
b                   2
c           [a, b, c]
d                 3.5
e    {'key': 'value'}
dtype: object

If you want the value with specific index, you can do so by calling the index.

In [35]:
obj['a']

'apple'

In [36]:
obj['e']

{'key': 'value'}

In [37]:
obj['e']['key']

'value'

Pandas DataFrame is a spreadsheet-like data structure. You can think of it as a table with rows and columns. Each column is a Pandas Series. You can create a DataFrame by passing in a dictionary of Pandas Series. The keys of the dictionary will be the column names and the values will be the values in the column.

In [80]:
df = pd.DataFrame({'a':[1,2,3,'a','b','c', 'a','B','C'], 
                   'b':[4,5,6,'d','e','f', 'D','E','F'], 
                   'c':[7,8,9,'a','b','c', 'G','H','I'], 
                   'd':[10,11,12,13,14,15,16,17,18], 
                   'e':[13,14,15,'m','n','o', 'M','N','O'], 
                   'f':[16,17,18,'p','q','r', 'P','Q','R']})

In [73]:
df

   a  b  c   d   e   f
0  1  4  7  10  13  16
1  2  5  8  11  14  17
2  3  6  9  12  15  18
3  a  d  a   j   m   p
4  b  e  b   k   n   q
5  c  f  c   l   o   r
6  A  D  G   J   M   P
7  B  E  H   K   N   Q
8  C  F  I   L   O   R

You can return the first few rows of the DataFrame by calling the head() function. You can also return the last few rows of the DataFrame by calling the tail() function.

In [51]:
df.head()

   a  b  c   d   e   f
0  1  4  7  10  13  16
1  2  5  8  11  14  17
2  3  6  9  12  15  18
3  a  d  g   j   m   p
4  b  e  h   k   n   q

In [52]:
df.tail()

   a  b  c  d  e  f
4  b  e  h  k  n  q
5  c  f  i  l  o  r
6  A  D  G  J  M  P
7  B  E  H  K  N  Q
8  C  F  I  L  O  R

We can also specify the number of rows we want to return by passing in the number as an argument to the head() and tail() functions.

In [53]:
df.head(2)

   a  b  c   d   e   f
0  1  4  7  10  13  16
1  2  5  8  11  14  17

In [54]:
df.tail(2)

   a  b  c  d  e  f
7  B  E  H  K  N  Q
8  C  F  I  L  O  R

When we want to get rid of the column, we can do so by calling the drop() function. We need to specify the axis=1 to indicate that we are dropping a column. If we want to drop a row, we can do so by calling the drop() function and specify the axis=0.

In [57]:
df.drop(['a', 'b'], axis=1)

   c   d   e   f
0  7  10  13  16
1  8  11  14  17
2  9  12  15  18
3  g   j   m   p
4  h   k   n   q
5  i   l   o   r
6  G   J   M   P
7  H   K   N   Q
8  I   L   O   R

In [66]:
df.drop([7, 8], axis=0)

   a  b  c   d   e   f
0  1  4  7  10  13  16
1  2  5  8  11  14  17
2  3  6  9  12  15  18
3  a  d  g   j   m   p
4  b  e  h   k   n   q
5  c  f  i   l   o   r
6  A  D  G   J   M   P

When you want to subset the DataFrame with specific values from specific column, you can place the condition in the square brackets.

In [79]:
df[df['a']=='a']

   a  b  c  d  e  f
3  a  d  a  j  m  p
6  a  D  G  J  M  P

In [81]:
df[df['d']>12]

   a  b  c   d  e  f
3  a  d  a  13  m  p
4  b  e  b  14  n  q
5  c  f  c  15  o  r
6  a  D  G  16  M  P
7  B  E  H  17  N  Q
8  C  F  I  18  O  R